---
kind: method
id: M:Autodesk.Revit.DB.SATExportOptions.#ctor(Autodesk.Revit.DB.SATExportOptions)
source: html/00776865-9477-5550-9516-333c0a4726d2.htm
---
# Autodesk.Revit.DB.SATExportOptions.#ctor Method

Constructs a new instance of SATImportOptions as a copy of the export options.

## Syntax (C#)
```csharp
public SATExportOptions(
	SATExportOptions option
)
```

## Parameters
- **option** (`Autodesk.Revit.DB.SATExportOptions`) - The options to be copied.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null